In [446]:
import pandas as pd

In [447]:
data = pd.read_csv("./Year_Released Title and Metacritic Rating.csv")
imdb_db = pd.read_csv('./imdb_db.csv')

In [448]:
imdb_db = imdb_db[['primaryTitle','averageRating','startYear']]
imdb_db = pd.DataFrame(imdb_db)
imdb_db.columns = ['Title','Imdb Rating','Year']

In [450]:
data_1plus = data.loc[data['Year'] != 'TBA']
data_1plus['Year'] = data_1plus['Year'].astype(int)
data_1plus['Year'] = data_1plus['Year'] + 1

           Title  Year  Metacritic Rating
0   Citizen Kane  1942                100
1  The Godfather  1973                100
2    Rear Window  1955                100
3     Casablanca  1944                100
4        Boyhood  2015                100

In [451]:
combined_1plus = pd.merge(data_1plus,imdb_db,how='inner',on = ('Title','Year'))

In [453]:
data_2plus = data.loc[data['Year'] != 'TBA']
data_2plus['Year'] = data_2plus['Year'].astype(int)
data_2plus['Year'] = data_2plus['Year'] + 2

           Title  Year  Metacritic Rating
0   Citizen Kane  1943                100
1  The Godfather  1974                100
2    Rear Window  1956                100
3     Casablanca  1945                100
4        Boyhood  2016                100

In [454]:
combined_2plus = pd.merge(data_2plus,imdb_db,how='inner',on = ('Title','Year'))

In [456]:
data_3plus = data.loc[data['Year'] != 'TBA']
data_3plus['Year'] = data_3plus['Year'].astype(int)
data_3plus['Year'] = data_3plus['Year'] + 3
data_3plus.head()

           Title  Year  Metacritic Rating
0   Citizen Kane  1944                100
1  The Godfather  1975                100
2    Rear Window  1957                100
3     Casablanca  1946                100
4        Boyhood  2017                100

In [457]:
combined_3plus = pd.merge(data_3plus,imdb_db,how='inner',on = ('Title','Year'))

In [459]:
data_4plus = data.loc[data['Year'] != 'TBA']
data_4plus['Year'] = data_4plus['Year'].astype(int)
data_4plus['Year'] = data_4plus['Year'] + 4

           Title  Year  Metacritic Rating
0   Citizen Kane  1945                100
1  The Godfather  1976                100
2    Rear Window  1958                100
3     Casablanca  1947                100
4        Boyhood  2018                100

In [460]:
combined_4plus = pd.merge(data_4plus,imdb_db,how='inner',on = ('Title','Year'))

In [462]:
data_5plus = data.loc[data['Year'] != 'TBA']
data_5plus['Year'] = data_5plus['Year'].astype(int)
data_5plus['Year'] = data_5plus['Year'] + 4

           Title  Year  Metacritic Rating
0   Citizen Kane  1945                100
1  The Godfather  1976                100
2    Rear Window  1958                100
3     Casablanca  1947                100
4        Boyhood  2018                100

In [463]:
combined_5plus = pd.merge(data_5plus,imdb_db,how='inner',on = ('Title','Year'))

In [465]:
data_1minus = data.loc[data['Year'] != 'TBA']
data_1minus['Year'] = data_1minus['Year'].astype(int)
data_1minus['Year'] = data_1minus['Year'] - 1

In [466]:
combined_1minus = pd.merge(data_1minus,imdb_db,how='inner',on = ('Title','Year'))

In [468]:
data_2minus = data.loc[data['Year'] != 'TBA']
data_2minus['Year'] = data_2minus['Year'].astype(int)
data_2minus['Year'] = data_2minus['Year'] - 2

In [469]:
combined_2minus = pd.merge(data_2minus,imdb_db,how='inner',on = ('Title','Year'))

In [471]:
data_3minus = data.loc[data['Year'] != 'TBA']
data_3minus['Year'] = data_3minus['Year'].astype(int)
data_3minus['Year'] = data_3minus['Year'] - 3

In [472]:
combined_3minus = pd.merge(data_3minus,imdb_db,how='inner',on = ('Title','Year'))

In [474]:
data_4minus = data.loc[data['Year'] != 'TBA']
data_4minus['Year'] = data_4minus['Year'].astype(int)
data_4minus['Year'] = data_4minus['Year'] - 4

In [475]:
combined_4minus = pd.merge(data_4minus,imdb_db,how='inner',on = ('Title','Year'))

In [477]:
data_5minus = data.loc[data['Year'] != 'TBA']
data_5minus['Year'] = data_5minus['Year'].astype(int)
data_5minus['Year'] = data_5minus['Year'] - 5

In [478]:
combined_5minus = pd.merge(data_5minus,imdb_db,how='inner',on = ('Title','Year'))

In [480]:
near_matches = [combined_1plus,combined_2plus,combined_3plus,combined_4plus,combined_5plus,combined_1minus,combined_2minus,combined_3minus,combined_4minus,combined_5minus]

In [481]:
near_matches_df = pd.concat(near_matches)
near_matches_df.reset_index(drop=True)
near_matches_df.drop_duplicates()

            Title  Year  Metacritic Rating  Imdb Rating
0  Boys Don't Cry  2000                 90          7.6
1      The Circle  2002                 88          5.0
2        Together  2002                 87          7.4
0     Taxi Driver  1978                 96          5.4
1      The Circle  2003                 88          5.0

In [482]:
near_matches_df.to_csv(index=False, path_or_buf = './Near Matches')